"""
Найти значение выражений:
x = 17 / 2 * 3 + 2
x = 2 + 17 / 2 * 3
x = 19 % 4 + 15 / 2 * 3
x = (15 + 6) - 10 * 4
x = 17 / 2 % 2 * 3
"""

x = 17 / 2 * 3 + 2
print(x)

x = 2 + 17 / 2 * 3
print(x)

x = 19 % 4 + 15 / 2 * 3
print(x)


x = (15 + 6) - 10 * 4
print(x)

x = 17 / 2 % 2 * 3
print(x)

"""Расставить скобки так, чтобы значение выражений поменялось."""

x = (17 / 2) * 3 + 2
print(x)

x = 2 + (17 / 2 * 3)
print(x)

x = (19 % 4) + (15 / 2 * 3)
print(x)

x = 15 + 6 - (10 * 4)
print(x)

x = (17 / 2) % 2 * 3
print(x)

"""
Создать три переменные, содержащие возраст трех ваших друзей, 
в качестве имен переменных использовать имена друзей, найти сумму и вывести ее на экран.
"""
maxim = 17
alex = 37
olga = 33

print(maxim + alex + olga)

"""
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.
"""

avg_age = (maxim + alex + olga) / 3
print(avg_age)